In [4]:
import numpy as np
import pandas as pd

In [5]:
s1 = pd.Series(np.random.rand(4),index=['a','b','c','d'])

In [6]:
s1.values

array([0.42838506, 0.31076196, 0.53780123, 0.01418616])

In [4]:
s2 = pd.Series(np.random.rand(4))

In [5]:
s2

0    0.207859
1    0.934198
2    0.959841
3    0.238483
dtype: float64

In [6]:
s1['c']

0.15432518380697058

In [8]:
s1

a    0.510953
b    0.380865
c    0.154325
d    0.893130
dtype: float64

In [9]:
s3 = pd.Series({'001':'Nam','002':'Mary','003':'Peter'})

In [10]:
s3

001      Nam
002     Mary
003    Peter
dtype: object

In [11]:
s4 = pd.Series({'001':'Nam','002':'Mary','003':'Peter'},index=['002','001','024','065'])

In [12]:
s4

002    Mary
001     Nam
024     NaN
065     NaN
dtype: object

In [13]:
pd.isnull(s4) #detect missing data

002    False
001    False
024     True
065     True
dtype: bool

In [22]:
s6 = pd.Series(np.array([2.71,3.14]),index=['z','y'])

In [23]:
s6

z    2.71
y    3.14
dtype: float64

In [24]:
data = {'Year':[2000,2005,2010,2014],
       'Median_Age':[24.2,26.4,28.5,30.3],
       'Density':[244,256,268,279]}

In [25]:
df1 = pd.DataFrame(data)

In [26]:
df1

   Year  Median_Age  Density
0  2000        24.2      244
1  2005        26.4      256
2  2010        28.5      268
3  2014        30.3      279

In [27]:
df2 = pd.DataFrame(data,columns=['Year','Density','Median_Age'])

In [28]:
df2

   Year  Density  Median_Age
0  2000      244        24.2
1  2005      256        26.4
2  2010      268        28.5
3  2014      279        30.3

In [29]:
df3 = pd.DataFrame(data, columns=['Year', 'Density',
'Median_Age'], index=['a', 'b', 'c', 'd'])

In [30]:
df3

   Year  Density  Median_Age
a  2000      244        24.2
b  2005      256        26.4
c  2010      268        28.5
d  2014      279        30.3

In [31]:
df4 = pd.DataFrame([
['Peter', 16, 'pupil', 'TN', 'M', None],
['Mary', 21, 'student', 'SG', 'F', None],
['Nam', 22, 'student', 'HN', 'M', None],
['Mai', 31, 'nurse', 'SG', 'F', None],
['John', 28, 'laywer', 'SG', 'M', None]],
columns=['name', 'age', 'career', 'province', 'sex', 'award'])

In [32]:
df4

    name  age   career province sex award
0  Peter   16    pupil       TN   M  None
1   Mary   21  student       SG   F  None
2    Nam   22  student       HN   M  None
3    Mai   31    nurse       SG   F  None
4   John   28   laywer       SG   M  None

In [33]:
df4['name']

0    Peter
1     Mary
2      Nam
3      Mai
4     John
Name: name, dtype: object

In [34]:
df4.name

0    Peter
1     Mary
2      Nam
3      Mai
4     John
Name: name, dtype: object

In [35]:
df4.award

0    None
1    None
2    None
3    None
4    None
Name: award, dtype: object

In [38]:
df4.loc[1]

name           Mary
age              21
career      student
province         SG
sex               F
award          None
Name: 1, dtype: object

In [39]:
df4 = pd.read_csv('person.csv')

In [40]:
df4

    name  age   career province sex
0  Peter   16    pupil       TN   M
1   Mary   21  student       SG   F
2    Nam   22  student       HN   M
3    Mai   31    nurse       SG   F
4   John   28    lawer       SG   M

In [41]:
s2.reindex([0,2,'b',3])

0    0.207859
2    0.959841
b         NaN
3    0.238483
dtype: float64

In [42]:
s7 = pd.Series(np.random.rand(1000))

In [43]:
s7.head()

0    0.668919
1    0.443435
2    0.035318
3    0.571343
4    0.497199
dtype: float64

In [44]:
s7.tail(3)

997    0.641326
998    0.816090
999    0.139118
dtype: float64